/** 변수 규칙!
 * 라틴문자(0-9, a-z, A-Z,), _
 * 대소문자를 구분함
 * 추천: camelCase (likeThis) ✅
 * 한국어 ❌
 * 예약어 ❌
 * 숫자로 시작 ❌
 * 특수문자 ❌ (_, $ 두 가지는 예외)
 * 이모지 ❌
 * 여러개의 변수를 1, 2, 3 숫자로 구분 ❌ -> 최대한 의미있게, 구체적인 이름으로 작성!
 * 변수명은 명사로 작성해주는 것이 좋음!
 */

// 나쁜예제 💣🔫💥
let num = 20;

// 좋은예제 ✨
let myAge = 20;

// 나쁜예제 💣🔫💥
let audio1;
let audio2;

// 좋은예제 ✨
let backgroundAudio;
let windAudio;

// 꿀팁! 🍯
// 변수명에 중요한 걸 먼저 써주면 나중에 자동완성으로 찾을 때 편함!!
let audioBackground;
let audioWind;

/**
 * 변수명 작성 방법
 * https://developer.mozilla.org/ko/docs/Learn/JavaScript/First_steps/Variables
 */
